## Pandas Basic
## 20180725
## Sungjae Lee

In [15]:
import pandas as pd
import numpy as np

### 1. Series

In [3]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data = pd.read_csv(data_url, sep = '\s+', header = None)

In [4]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [11]:
list_data = [1, 2, 3, 4, 5]
example_obj = pd.Series(data = list_data)
example_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
list_name = ['a', 'b', 'c', 'd', 'e']
example_obj = pd.Series(data = list_data, index = list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [16]:
dict_data = {'a':1, 'b':2, 'c':3}
example_obj = pd.Series(dict_data, dtype = np.float32, name = 'example data')
example_obj

a    1.0
b    2.0
c    3.0
Name: example data, dtype: float32

In [17]:
example_obj['a']

1.0

In [18]:
example_obj['a'] = 100
example_obj

a    100.0
b      2.0
c      3.0
Name: example data, dtype: float32

In [25]:
print(example_obj.values)
print(example_obj.index)
print(example_obj)

example_obj.name = 'numbers'

[100.   2.   3.]
Index(['a', 'b', 'c'], dtype='object')
a    100.0
b      2.0
c      3.0
Name: numbers, dtype: float32

In [29]:
dict_data_1 = {'a':1, 'b':2, 'c':3}
indexes = ['A', 'B', 'c', 'd', 'e']
series_obj_1 = pd.Series(dict_data_1, index = indexes)
series_obj_1

A    NaN
B    NaN
c    3.0
d    NaN
e    NaN
dtype: float64

### 2. DataFrame

In [31]:
raw_data = {'first_name':['Jason', 'Molly', 'Tina'],
           'last_name':['Miller', 'Jacobson', 'Ali'],
           'age':[42, 52, 12],
           'city':['San', 'Balt', 'Nia']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age  city
0      Jason    Miller   42   San
1      Molly  Jacobson   52  Balt
2       Tina       Ali   12   Nia

In [35]:
pd.DataFrame(raw_data, columns = ['age', 'city'])
pd.DataFrame(raw_data, columns = ['age', 'city', 'new_col'])

   age  city new_col
0   42   San     NaN
1   52  Balt     NaN
2   12   Nia     NaN

In [37]:
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df.first_name

0    Jason
1    Molly
2     Tina
Name: first_name, dtype: object

In [38]:
df['first_name']

0    Jason
1    Molly
2     Tina
Name: first_name, dtype: object

In [43]:
print(df.loc[1])
print('\n\n')
print(df['age'].iloc[1:])

first_name       Molly
last_name     Jacobson
age                 52
city              Balt
Name: 1, dtype: object



1    52
2    12
Name: age, dtype: int64

In [55]:
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])
df.debt = df.age > 40
df

  first_name last_name  age  city   debt
0      Jason    Miller   42   San   True
1      Molly  Jacobson   52  Balt   True
2       Tina       Ali   12   Nia  False

In [50]:
df.T
# 전치행렬 형태로 출력한다

array([['Jason', 'Miller', 42, 'San', True],
       ['Molly', 'Jacobson', 52, 'Balt', True],
       ['Tina', 'Ali', 12, 'Nia', False]], dtype=object)

In [51]:
df.to_csv('first_pandas_dataframe.csv')
# csv 파일로 저장한다

In [56]:
del df['debt']
df

  first_name last_name  age  city
0      Jason    Miller   42   San
1      Molly  Jacobson   52  Balt
2       Tina       Ali   12   Nia

In [60]:
pop = {'Nevada':{2001:2.4, 2002:2.9},
      'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}
pop_df = pd.DataFrame(pop)
pop_df

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [70]:
print(pop_df['Nevada'].head(1))
print(pop_df.tail(1))
print(pop_df[-1:])
print(pop_df['Ohio'][2:])

2000   NaN
Name: Nevada, dtype: float64
      Nevada  Ohio
2002     2.9   3.6
      Nevada  Ohio
2002     2.9   3.6
2002    3.6
Name: Ohio, dtype: float64